---
kind: other
id: Properties.T:Autodesk.Revit.DB.ElementRecord
source: html/bc216130-3718-8c51-86b0-8de7c1e664af.htm
---
# ElementRecord Properties

Specifies whether the .NET object represents a valid Revit entity.